//=============================================================================
//
// タイトル処理 [title.cpp]
// Author : KADO TAKUMA
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "title.h"
#include "camera.h"
#include "light.h"
#include "polygon.h"
#include "fade.h"
#include "result.h"

//=============================================================================
// スタティック変数
//=============================================================================
int g_nTitleRotate;		//タイトルでカメラを自動的に回転させるための変数

//=============================================================================
// 初期化処理
//=============================================================================
void InitTitle(void)
{
	//ポリゴンの初期化処理
	InitPolygon();

	//リザルトの初期化処理
	InitResult();

	//リザルトのセット処理
	SetResult(1,2);

	//カメラの初期化処理
	InitCamera();

	//ライトの初期化処理
	InitLight();
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitle(void)
{
	//ポリゴンの終了処理
	UninitPolygon();

	//リザルトの終了処理
	UninitResult();

	//カメラの終了処理
	UninitCamera();

	//ライトの終了処理
	UninitLight();
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitle(void)
{
	//フェードの情報を取得
	FADE pFade = GetFade();

	//決定キー(ENTERキー)が押されたかどうか
	if ((GetKeyboardTrigger(DIK_RETURN) && pFade == FADE_NONE))
	{
		//モードのセット処理
		SetFade(MODE_GAME);
	}

	//リザルトの更新処理
	UpdateResult();

	//カメラの更新処理
	UpdateCamera();

	//ポリゴンの更新処理
	UpdatePolygon();

	//ライトの更新処理
	UpdateLight();
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitle(void)
{
	//カメラの設定処理
	SetCamera();

	//ポリゴンの描画処理
	DrawPolygon();

	//リザルトの描画処理
	DrawResult();
}

//=============================================================================
// タイトルの情報を取得
//=============================================================================
int GetTitle(void)
{
	return g_nTitleRotate;
}